---
title: ParameterValue
classe: Autodesk.Revit.DB.ParameterValue
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ParameterValue

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `parameterValue.IsValidObject` | Boolean |
| `ParameterValue Copy()` | `parameterValue.Copy()` | ParameterValue |
| `Void Dispose()` | `parameterValue.Dispose()` | Void |
| `Boolean IsEqual(ParameterValue)` | `parameterValue.IsEqual(other)` | Boolean |
| `Boolean IsSameType(ParameterValue)` | `parameterValue.IsSameType(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```